import numpy as np
import pandas as pd

info = pd.read_csv("crime.csv")
# 지시사항 1
info_group = info.groupby(["범죄대분류"]).sum()
info_group = info_group.reset_index()
# 지시사항 2
new_info = info_group.iloc[:, 1:9].idxmax(axis=1)
new_info = new_info.to_frame(name="최대 범죄 발생 시간대")
new_info["범죄대분류"] = info_group["범죄대분류"]
new_info = new_info.reindex(columns=["범죄대분류", "최대 범죄 발생 시간대"])

# 아래의 코드는 정답과 관계가 없는 코드입니다. 변경을 자유롭게 해주셔도 됩니다.

print(info_group)
print(new_info)

####결과

#      범죄대분류  0시00분-02시59분  03시00분-05시59분  06시00분-08시59분  09시00분-11시59분  12시00분-14시59분  15시00분-17시59분  18시00분-20시59분  21시00분-23시59분      미상      일      월      화      수      목      금      토
# 0     강력범죄          2920           3316           1977           1799           1966           2447           3089           4215    4747   4081   3519   3607   3634   3445   3880   4310
# 1     교통범죄         24513          23438          37189          44265          45675          53506          58164          70537   20067  47698  51459  53605  54509  54846  58103  57134
# 2     기타범죄         10376           9184           9935          31337          22841          20037          18200          22421   95837  25278  39244  37277  36996  37250  37367  26756
# 3     노동범죄            20             41             80            124            125            117             53             78     337     85    162    139    168    175    143    103
# 4     마약범죄           244            214            151            635            773            890            776            674    3681    789   1278   1352   1219   1195   1272    933
# 5     병역범죄             3              1             20           1440            285             55             58             19   10831    111   3068   3580   1940   2082   1834     97
# 6     보건범죄           596            404            140            880            694           1009            893           1747    6207    934   2051   2096   1962   2043   2085   1399
# 7     선거범죄             0              1             22            121             53             34             38              3     339     65     90     91    100    113     95     57
# 8     안보범죄             2              0              0             10             18             10              3              6     120     36     25     13     22     25     24     24
# 9     절도범죄         13088          14167          13094          21501          27167          28553          27229          20568   21590  25466  26239  25671  26061  26098  28156  29266
# 10    지능범죄          8393           6637           5971          49269          38231          28941          20981          19100  204010  29037  64776  63173  62642  63327  64724  33854
# 11  특별경제범죄          1688           1426           1333           6702           5340           4802           3768           4320   22021   3948   8724   8608   8477   8432   8502   4709
# 12    폭력범죄         31290          26880          17572          23112          23919          28939          39618          57944   38639  45295  38034  38553  38905  39086  41198  46842
# 13    풍속범죄           920            709            887           1582           1713           2577           2543           2750    7472   2529   3063   3130   3303   3204   3273   2651
# 14    환경범죄            42             53            117            458            290            190             90            126    2511    168    749    696    652    653    696    263

#      범죄대분류   최대 범죄 발생 시간대
# 0     강력범죄  21시00분-23시59분
# 1     교통범죄  21시00분-23시59분
# 2     기타범죄  09시00분-11시59분
# 3     노동범죄  12시00분-14시59분
# 4     마약범죄  15시00분-17시59분
# 5     병역범죄  09시00분-11시59분
# 6     보건범죄  21시00분-23시59분
# 7     선거범죄  09시00분-11시59분
# 8     안보범죄  12시00분-14시59분
# 9     절도범죄  15시00분-17시59분
# 10    지능범죄  09시00분-11시59분
# 11  특별경제범죄  09시00분-11시59분
# 12    폭력범죄  21시00분-23시59분
# 13    풍속범죄  21시00분-23시59분
# 14    환경범죄  09시00분-11시59분
